#!/bin/sh

####################################################################################################
#	@ 如果出现不统计流量 那几乎是不可能是 只要这里正确对接就不会有问题
#	@ 本文件接管了流控的权限 所以不要问为什么 代码这么少


#   【一般情况下 修改本文件后 请直接替换流控自带即可！！！！！！！】



#	@ 如果您的流控较为特殊 请您把代码中 version=2 改为=1 然后放在流控自带disconnect.sh最后一行即可 
#   @ 记得给了本文件0777 权限后重启  yes
#	@这里强烈推荐手动个top_api.php改为其他名字（当然必须说.php结尾且云端中对应的文件也要修改）防止别人非法执行
#---------------->>>切记 改top_api.php的名字 否则后果自负	
####################################################################################################
curl "http://192.168.1.1:8888/app_api/top_api.php?name=$common_name&s=$bytes_sent&r=$bytes_received&version=2"
